{
  "metadata": {
    "source": "المفاتيح الجديدة (Al-Mafatih Al-Jadidat)",
    "author": "آية الله العظمى مكارم شيرازي",
    "section": "الأعمال المشتركة لشهر رمضان المبارك - Common Acts for the Blessed Month of Ramadan",
    "extracted_from": "shahr_ramadan_translated.json",
    "description": "Common acts to be performed for every day and night during the month of Ramadan"
  },
  "content": {
    "title": "الأعمال المشتركة لشهر رمضان المبارك:",
    "type": "sub_section",
    "level": 5,
    "items": [
      {
        "id": 62,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "الأعمال المشتركة لكلّ يوم وليلة:",
        "english": "The common acts for every day and night:",
        "transliteration": "Al-a'mal al-mushtarakah li-kulli yawmin wa-laylatin:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 63,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "الأعمال المشتركة لكل يوم وليلة لشهر رمضان كثيرة جدّاً منها:",
        "english": "The common acts for every day and night of the month of Ramadan are very many, including:",
        "transliteration": "Al-a'mal al-mushtarakah li-kulli yawmin wa-laylatin li-shahri Ramadan kathiratun jiddan minha:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 64,
        "content_type": "",
        "translation_mode": "",
        "arabic": "1. روى السيّد ابن طاووس عن الإمامين الصادق والكاظم عليهما السلام قالا: «",
        "english": "1. Sayyid Ibn Tawus narrated from the two Imams, al-Sadiq and al-Kadhim (peace be upon them), who said: “",
        "transliteration": "1. Rawa al-Sayyid Ibn Tawus 'an al-Imamayni al-Sadiq wal-Kazim 'alayhima al-salam qala: «",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": "The Hajj Supplication (after every obligatory prayer)"
      },
      {
        "id": 65,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "تقول في شهر رمضان من أوّله إلى آخره بعد كلّ فريضة",
        "english": "You say throughout the month of Ramadan, from its beginning to its end, after every obligatory prayer:",
        "transliteration": "Taqulu fi shahri Ramadan min awwalihi ila akhirihi ba'da kulli faridah.",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": "The Hajj Supplication (after every obligatory prayer)"
      },
      {
        "id": 66,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "»: اللهُمَّ ارْزُقْنى حَجَّ بَيْتِكَ الْحَرامِ، فى عامى هذا وَفى كُلِّ عامٍ، ما ابْقَيْتَنى فى يُسْرٍ مِنْكَ وَعافِيَةٍ وَسَعَةِ رِزْقٍ، وَلا تُخْلِنى مِنْ تِلْكَ الْمواقِفِ الْكَريمَةِ، وَالْمَشاهِدِ الشَّريفَةِ، وَزِيارَةِ قَبْرِ نَبِيِّكَ صَلَواتُكَ عَلَيْهِ وَآلِهِ، وَفى جَميعِ حَوائِجِ الدُّنْيا وَالأخِرَةِ فَكُنْ لى اللَّهُمَّ انّى اسْئَلُكَ فيما تَقْضى وَتُقَدِّرُ مِنَ الْأَمْرِ الْمَحْتُومِ فى لَيْلَةِ الْقَدْرِ، مِنَ الْقَضآءِ الَّذى لا يُرَدُّ وَلا يُبَدَّلُ، انْ تَكْتُبَنى مِنْ حُجَّاجِ بَيْتِكَ الْحَرامِ، الْمَبْرُورِ حَجُّهُمْ، الْمَشْكُورِ سَعْيُهُمْ، الْمَغْفُورِ ذُنُوبُهُمْ، الْمُكَفَّرِ عَنْهُمْ سَيِّئاتُهُمْ، وَاجْعَلْ فيما تَقْضى وَتُقَدِّرُ انْ تُطيلَ عُمْرى وَتُوَسِّعَ عَلَىَّ رِزْقى وَتُؤدِّىَ عَنّى امانَتى وَدَيْنى آمينَ رَبَّ الْعالَمينَ.",
        "english": "“O Allah, grant me the Hajj to Your Sacred House, in this year of mine and in every year, as long as You keep me alive, in ease from You, well-being, and abundance of provision. Do not deprive me of those noble stations and honorable sites, nor of visiting the grave of Your Prophet—Your blessings be upon him and his progeny. And regarding all the needs of this world and the hereafter, be there for me. O Allah, I ask You that within what You decree and ordain of the inevitable matter on Laylat al-Qadr—from the decree that is neither overturned nor changed—to record me among the pilgrims of Your Sacred House, whose Hajj is accepted, whose effort is appreciated, whose sins are forgiven, and whose evil deeds are expiated. And include within what You decree and ordain that You prolong my life, expand for me my provision, and fulfill for me my trusts and my debts. Amen, O Lord of the worlds.”",
        "transliteration": "»: Allahumma-rzuqni hajja baytika al-harami, fi 'ami hadha wa fi kulli 'amin, ma abqaytani fi yusrin minka wa 'afiyatin wa sa'ati rizqin, wa la tukhlini min tilka al-mawaqifi al-karimati, wal-mashahidi al-sharifati, wa ziyarati qabri nabiyyika salawatuka 'alayhi wa alihi, wa fi jami'i hawa'iji al-dunya wal-akhirati fakun li. Allahumma inni as'aluka fima taqdi wa tuqaddiru min al-amri al-mahtumi fi laylati al-qadri, min al-qada'i al-ladhi la yuraddu wa la yubaddalu, an taktubani min hujjaji baytika al-harami, al-mabruri hajjuhum, al-mashkuri sa'yuhum, al-maghfuri dhunubuhum, al-mukaffari 'anhum sayyi'atuhum, waj'al fima taqdi wa tuqaddiru an tutila 'umri wa tuwassi'a 'alayya rizqi wa tu'addiya 'anni amanati wa dayni, Amina Rabba al-'alamin.",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 67,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "وتدعو عقيب كلّ فريضة فتقول:",
        "english": "And you offer supplication after every obligatory prayer, saying:",
        "transliteration": "Wa-tad'u 'aqiba kulli faridah fataqulu:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 68,
        "content_type": "",
        "translation_mode": "",
        "arabic": "يا عَلِىُّ يا عَظيمُ، يا غَفُورُ يا رَحيمُ، انْتَ الرَّبُّ الْعَظيمُ، الَّذى لَيْسَ كَمِثْلِهِ شَىْ ءٌ، وَهُوَ السَّميعُ الْبَصيرُ، وَهذا شَهْرٌ عَظَّمْتَهُ وَكَرَّمْتَهُ، وَشَرَّفْتَهُ وَفَضَّلْتَهُ عَلَى الشُّهُورِ،",
        "english": "O Most High, O Magnificent! O All-Forgiving, O All-Merciful! You are the Magnificent Lord, the One whom there is nothing like, and He is the All-Hearing, the All-Seeing. And this is the month which You have magnified and honored, and ennobled and favored above all other months,",
        "transliteration": "Ya 'Aliyyu ya 'Azimu, ya Ghafuru ya Rahimu, Anta al-Rabbu al-'Azimu, al-ladhi laysa ka-mithlihi shay'un, wa huwa al-Sami'u al-Basiru, wa hadha shahrun 'azzamtahu wa karramtahu, wa sharraftahu wa faddaltahu 'ala al-shuhuri,",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": "The Supplication 'Ya 'Aliyyu Ya 'Adheem'"
      },
      {
        "id": 69,
        "content_type": "",
        "translation_mode": "",
        "arabic": "وَهُوَ الشَّهْرُ الَّذى فَرَضْتَ صِيامَهُ عَلَىَّ، وَهُوَ شَهْرُ رَمَضانَ، الَّذى انْزَلْتَ فيهِ الْقُرْآنَ، هُدًى لِلنَّاسِ وَبَيِّناتٍ مِنَ الْهُدى وَالْفُرْقانِ، وَجَعَلْتَ فيهِ لَيْلَةَ الْقَدْرِ، وَجَعَلْتَها خَيْراً مِنْ الْفِ شَهْرٍ، فَيا ذَا الْمَنِّ وَلا يُمَنُّ عَلَيْكَ، مُنَّ عَلَىَّ بِفَكاكِ رَقَبَتى مِنَ النَّارِ، فيمَنْ تَمُنُّ عَلَيْهِ، وَادْخِلْنِى الْجَنَّةَ، بِرَحْمَتِكَ يا ارْحَمَ الرَّاحِمينَ .",
        "english": "and it is the month in which You have made fasting obligatory upon me; it is the month of Ramadan, in which You revealed the Quran, as guidance for mankind and clear proofs of guidance and the criterion. And You have placed within it the Night of Power, and made it better than a thousand months. O Bestower of favors, upon whom no favor can be bestowed! Bestow Your favor upon me by releasing my neck from the Fire, among those upon whom You bestow Your favor, and admit me into Paradise, by Your mercy, O Most Merciful of the merciful.",
        "transliteration": "Wa huwa al-shahru al-ladhi faradta siyamahu 'alayya, wa huwa shahru Ramadana, al-ladhi anzalta fihi al-Qur'ana, hudan lin-nasi wa bayyinatin mina al-huda wal-furqani, wa ja'alta fihi laylata al-qadri, wa ja'altaha khayran min alfi shahrin, fa-ya dhal-manni wa la yumannu 'alayka, munna 'alayya bi-fakaki raqabati mina al-nari, fiman tamunnu 'alayhi, wa adkhilni al-jannata, bi-rahmatika ya arhama al-rahimin.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_472_1",
            "ref_num": "(1)",
            "title": "إقبال الأعمال: ص 24."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 70,
        "content_type": "",
        "translation_mode": "",
        "arabic": "2. روى الكفعمي في المصباح والبلد الأمين عن النبيّ صلى الله عليه و آله أنّه قال: «",
        "english": "2. Al-Kaf’ami narrated in al-Misbah and al-Balad al-Amin from the Prophet (peace and blessings of Allah be upon him and his family) that he said: “",
        "transliteration": "2. Rawa al-Kaf'ami fi al-Misbah wal-Balad al-Amin 'an al-Nabiyyi salla Allahu 'alayhi wa-alihi annahu qala: «",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 71,
        "content_type": "",
        "translation_mode": "",
        "arabic": "مَنْ دَعا بهذا الدُّعاءِ فِي رَمَضانَ بَعْدَ كُلِّ فَرِيضَةٍ غَفَرَ اللَّهُ لَهُ ذُنوبَهُ",
        "english": "Whoever recites this supplication in Ramadan after every obligatory prayer, Allah will forgive his sins.",
        "transliteration": "Man da'a bi-hadha al-du'a'i fi Ramadana ba'da kulli faridatin ghafara Allahu lahu dhunubahu.",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": "The Supplication for the People of the Graves (after every obligatory prayer)"
      },
      {
        "id": 72,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "»: اللَّهُمَّ ادْخِلْ عَلى اهْلِ الْقُبُورِ السُّرُورَ، اللَّهُمَّ اغْنِ كُلَّ فَقيرٍ، اللهُمَّ اشْبِعْ كُلَّ جائِعٍ، اللهُمَّ اكْسُ كُلَّ عُرْيانٍ، اللهُمَّ اقْضِ دَيْنَ كُلِّ مَدينٍ، اللهُمَّ فَرِّجْ عَنْ كُلِّ مَكْرُوبٍ، اللهُمَّ رُدَّ كُلَّ غَريبٍ، اللهُمَّ فُكَّ كُلَّ اسيرٍ، اللهُمَّ اصْلِحْ كُلَّ فاسِدٍ مِنْ امُورِ الْمُسْلِمينَ، اللهُمَّ اشْفِ كُلَّ مَريضٍ، اللهُمَّ سُدَّ فَقْرَنا بِغِناكَ، اللهُمَّ غَيِّرْ سُوءَ حالِنا بِحُسْنِ حالِكَ، اللهُمَّ اقْضِ عَنَّا الدَّيْنَ، وَاغْنِنا مِنَ الْفَقْرِ، انَّكَ عَلى كُلِّ شَىْ ءٍ قَديرٌ .",
        "english": "“O Allah, grant joy to the inhabitants of the graves. O Allah, enrich every poor person. O Allah, satisfy every hungry person. O Allah, clothe every unclothed person. O Allah, settle the debt of every debtor. O Allah, relieve the distress of every distressed person. O Allah, return every stranger home. O Allah, free every captive. O Allah, rectify every corruption in the affairs of the Muslims. O Allah, heal every sick person. O Allah, fill our poverty with Your wealth. O Allah, change our wretched state with the excellence of Your state. O Allah, settle our debt and enrich us from poverty. Indeed, You are powerful over all things.”",
        "transliteration": "»: Allahumma adkhil 'ala ahli al-quburi al-surura, Allahumma aghni kulla faqirin, Allahumma ashbi' kulla ja'i'in, Allahumma-ksu kulla 'uryanin, Allahumma-qdi dayna kulli madinin, Allahumma farrij 'an kulli makrubin, Allahumma rudda kulla gharibin, Allahumma fukka kulla asirin, Allahumma aslih kulla fasidin min umuri al-muslimina, Allahumma-shfi kulla maridin, Allahumma sudda faqrana bi-ghinaka, Allahumma ghayyir su'a halina bi-husni halika, Allahumma-qdi 'anna al-dayna, wa aghnina mina al-faqri, innaka 'ala kulli shay'in qadir.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_472_2",
            "ref_num": "(2)",
            "title": "مصباح الكفعمي: ص 617؛ البلد الأمين: ص 222؛ بحار الأنوار: ج 95، ص 120."
          }
        ],
        "custom_title": "The Supplication for the People of the Graves (after every obligatory prayer)"
      },
      {
        "id": 73,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "3. روى الكليني في الكافي عن أبي بصير قال: كان الصادق عليه السلام يدعو بهذا الدعاء في شهر رمضان:",
        "english": "3. Al-Kulayni narrated in al-Kafi from Abu Basir, who said: Al-Sadiq (peace be upon him) used to recite this supplication in the month of Ramadan:",
        "transliteration": "3. Rawa al-Kulayni fi al-Kafi 'an Abi Basir qala: kana al-Sadiq 'alayhi al-salam yad'u bi-hadha al-du'a'i fi shahri Ramadan:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 74,
        "content_type": "",
        "translation_mode": "",
        "arabic": "اللهُمَّ انّى بِكَ أَتَوَسَّلُ وَمِنْكَ اطْلُبُ حاجَتى مَنْ طَلَبَ حاجَةً الىَ النَّاسِ فَانّى لا اطْلُبُ حاجَتى الَّا مِنْكَ، وَحْدَكَ لا شَريكَ لَكَ، وَاسْئَلُكَ بِفَضْلِكَ وَرِضْوانِكَ، انْ تُصَلِّىَ عَلى مُحَمَّدٍ وَاهْلِ بَيْتِهِ، وَانْ تَجْعَلَ لى فى عامى هذا الى بَيْتِكَ الْحَرامِ سَبيلًا، حَجَّةً مَبْرُورَةً، مُتَقَبَّلَةً زاكِيَةً خالِصَةً لَكَ، تَقِرُّ بِها عَيْنى وَتَرْفَعُ بِها",
        "english": "O Allah, I seek access to You through You, and from You I seek my need. If others seek their needs from people, I do not seek my need except from You, alone, without any partner. I ask You by Your grace and Your pleasure to bless Muhammad and his household, and to grant me a way to Your Sacred House in this year of mine—a Hajj that is righteous, accepted, pure, and sincerely for You, by which my eye is delighted and by which You raise...",
        "transliteration": "Allahumma inni bika atawassalu wa minka atlubu hajati, man talaba hajatan ila al-nasi fa-inni la atlubu hajati illa minka, wahdaka la sharika laka, wa as-aluka bi-fadlika wa ridwanika, an tusalliya 'ala Muhammadin wa ahli baytihi, wa an taj'ala li fi 'ami hadha ila baytika al-harami sabilan, hajjatan mabruratan, mutaqabbalatan zakiyatan khalisatan laka, taqirru biha 'ayni wa tarfa'u biha.",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 75,
        "content_type": "",
        "translation_mode": "",
        "arabic": "وَهُوَ الشَّهْرُ الَّذى فَرَضْتَ صِيامَهُ عَلَىَّ، وَهُوَ شَهْرُ رَمَضانَ، الَّذى انْزَلْتَ فيهِ الْقُرْآنَ، هُدًى لِلنَّاسِ وَبَيِّناتٍ مِنَ الْهُدى وَالْفُرْقانِ، وَجَعَلْتَ فيهِ لَيْلَةَ الْقَدْرِ، وَجَعَلْتَها خَيْراً مِنْ الْفِ شَهْرٍ، فَيا ذَا الْمَنِّ وَلا يُمَنُّ عَلَيْكَ، مُنَّ عَلَىَّ بِفَكاكِ رَقَبَتى مِنَ النَّارِ، فيمَنْ تَمُنُّ عَلَيْهِ، وَادْخِلْنِى الْجَنَّةَ، بِرَحْمَتِكَ يا ارْحَمَ الرَّاحِمينَ .",
        "english": "and it is the month in which You have made fasting obligatory upon me; it is the month of Ramadan, in which You revealed the Quran, as guidance for mankind and clear proofs of guidance and the criterion. And You have placed within it the Night of Power, and made it better than a thousand months. So, O Bestower of favor, while no favor can be bestowed upon You, bestow Your favor upon me by releasing my neck from the Fire, among those whom You have favored, and admit me into Paradise, by Your mercy, O Most Merciful of the merciful.",
        "transliteration": "Wa huwa al-shahru al-ladhi faradta siyamahu 'alayya, wa huwa shahru Ramadana, al-ladhi anzalta fihi al-Qur'ana, hudan lin-nasi wa bayyinatin mina al-huda wal-furqani, wa ja'alta fihi laylata al-qadri, wa ja'altaha khayran min alfi shahrin, fa-ya dhal-manni wa la yumannu 'alayka, munna 'alayya bi-fakaki raqabati mina al-nari, fiman tamunnu 'alayhi, wa-adkhilni al-jannata, bi-rahmatika ya arhama al-rahimin.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_472_1",
            "ref_num": "(1)",
            "title": "إقبال الأعمال: ص 24."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 76,
        "content_type": "",
        "translation_mode": "",
        "arabic": "2. روى الكفعمي في المصباح والبلد الأمين عن النبيّ صلى الله عليه و آله أنّه قال: «",
        "english": "2. Al-Kaf’ami narrated in al-Misbah and al-Balad al-Amin from the Prophet (peace and blessings of Allah be upon him and his family) that he said: “",
        "transliteration": "2. Rawa al-Kaf'ami fi al-Misbah wal-Balad al-Amin 'an al-Nabiyyi salla Allahu 'alayhi wa-alihi annahu qala: «",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 77,
        "content_type": "",
        "translation_mode": "",
        "arabic": "مَنْ دَعا بهذا الدُّعاءِ فِي رَمَضانَ بَعْدَ كُلِّ فَرِيضَةٍ غَفَرَ اللَّهُ لَهُ ذُنوبَهُ",
        "english": "Whoever recites this supplication in Ramadan after every obligatory prayer, Allah will forgive his sins.",
        "transliteration": "Man da'a bi-hadha al-du'a'i fi Ramadana ba'da kulli faridatin ghafara Allahu lahu dhunubahu.",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 78,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "»: اللَّهُمَّ ادْخِلْ عَلى اهْلِ الْقُبُورِ السُّرُورَ، اللَّهُمَّ اغْنِ كُلَّ فَقيرٍ، اللهُمَّ اشْبِعْ كُلَّ جائِعٍ، اللهُمَّ اكْسُ كُلَّ عُرْيانٍ، اللهُمَّ اقْضِ دَيْنَ كُلِّ مَدينٍ، اللهُمَّ فَرِّجْ عَنْ كُلِّ مَكْرُوبٍ، اللهُمَّ رُدَّ كُلَّ غَريبٍ، اللهُمَّ فُكَّ كُلَّ اسيرٍ، اللهُمَّ اصْلِحْ كُلَّ فاسِدٍ مِنْ امُورِ الْمُسْلِمينَ، اللهُمَّ اشْفِ كُلَّ مَريضٍ، اللهُمَّ سُدَّ فَقْرَنا بِغِناكَ، اللهُمَّ غَيِّرْ سُوءَ حالِنا بِحُسْنِ حالِكَ، اللهُمَّ اقْضِ عَنَّا الدَّيْنَ، وَاغْنِنا مِنَ الْفَقْرِ، انَّكَ عَلى كُلِّ شَىْ ءٍ قَديرٌ .",
        "english": "“O Allah, grant joy to the inhabitants of the graves. O Allah, enrich every poor person. O Allah, satisfy every hungry person. O Allah, clothe every unclothed person. O Allah, settle the debt of every debtor. O Allah, relieve the distress of every distressed person. O Allah, return every stranger to his home. O Allah, free every captive. O Allah, rectify every corrupt matter of the Muslims’ affairs. O Allah, heal every sick person. O Allah, fill our poverty with Your wealth. O Allah, change our bad state with Your good state. O Allah, settle our debt and free us from poverty. Indeed, You are powerful over all things.”",
        "transliteration": "»: Allahumma adkhil 'ala ahli al-quburi al-surura, Allahumma aghni kulla faqirin, Allahumma ashbi' kulla ja'i'in, Allahumma-ksu kulla 'uryanin, Allahumma-qdi dayna kulli madinin, Allahumma farrij 'an kulli makrubin, Allahumma rudda kulla gharibin, Allahumma fukka kulla asirin, Allahumma aslih kulla fasidin min umuri al-muslimina, Allahumma-shfi kulla maridin, Allahumma sudda faqrana bi-ghinaka, Allahumma ghayyir su'a halina bi-husni halika, Allahumma-qdi 'anna al-dayna, wa aghnina mina al-faqri, innaka 'ala kulli shay'in qadirun.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_472_2",
            "ref_num": "(2)",
            "title": "مصباح الكفعمي: ص 617؛ البلد الأمين: ص 222؛ بحار الأنوار: ج 95، ص 120."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 79,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "3. روى الكليني في الكافي عن أبي بصير قال: كان الصادق عليه السلام يدعو بهذا الدعاء في شهر رمضان:",
        "english": "3. Al-Kulayni narrated in al-Kafi from Abu Basir, who said: Al-Sadiq (peace be upon him) used to recite this supplication in the month of Ramadan:",
        "transliteration": "3. Rawa al-Kulayni fi al-Kafi 'an Abi Basir qala: kana al-Sadiq 'alayhi al-salam yad'u bi-hadha al-du'a'i fi shahri Ramadan:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 80,
        "content_type": "",
        "translation_mode": "",
        "arabic": "اللهُمَّ انّى بِكَ أَتَوَسَّلُ وَمِنْكَ اطْلُبُ حاجَتى مَنْ طَلَبَ حاجَةً الىَ النَّاسِ فَانّى لا اطْلُبُ حاجَتى الَّا مِنْكَ، وَحْدَكَ لا شَريكَ لَكَ، وَاسْئَلُكَ بِفَضْلِكَ وَرِضْوانِكَ، انْ تُصَلِّىَ عَلى مُحَمَّدٍ وَاهْلِ بَيْتِهِ، وَانْ تَجْعَلَ لى فى عامى هذا الى بَيْتِكَ الْحَرامِ سَبيلًا، حَجَّةً مَبْرُورَةً، مُتَقَبَّلَةً زاكِيَةً خالِصَةً لَكَ، تَقِرُّ بِها عَيْنى وَتَرْفَعُ بِها",
        "english": "O Allah, I seek access to You through You, and from You I seek my need. If others seek their needs from people, I do not seek my need except from You, alone, without any partner. I ask You by Your grace and Your pleasure to bless Muhammad and his household, and to grant me a way to Your Sacred House in this year of mine—a Hajj that is pious, accepted, pure, and sincere for You, by which my eye is delighted and by which You elevate [me].",
        "transliteration": "Allahumma inni bika atawassalu wa minka atlubu hajati, man talaba hajatan ila al-nasi fa-inni la atlubu hajati illa minka, wahdaka la sharika laka, wa as-aluka bi-fadlika wa ridwanika, an tusalliya 'ala Muhammadin wa ahli baytihi, wa an taj'ala li fi 'ami hadha ila baytika al-harami sabilan, hajjatan mabruratan, mutaqabbalatan zakiyatan khalisatan laka, taqirru biha 'ayni wa tarfa'u biha.",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 81,
        "content_type": "",
        "translation_mode": "",
        "arabic": "دَرَجَتى وَتَرْزُقُنى انْ اغُضَّ بَصَرى وَانْ احْفَظَ فَرْجى وَانْ اكُفَّ بِها عَنْ جَميعِ مَحارِمِكَ، حَتّى لايَكُونَ شَىْ ءٌ آثَرَ عِنْدى مِنْ طاعَتِكَ وَخَشْيَتِكَ، وَالْعَمَلِ بِما احْبَبْتَ، وَالتَّرْكِ لِما كَرِهْتَ وَنَهَيْتَ عَنْهُ، وَاجْعَلْ ذلِكَ فى يُسْرٍ وَيَسارٍ وَعافِيَةٍ، وَاوْزِعْنى شُكْرَ ما انْعَمْتَ بِهِ عَلَىَّ، وَاسْئَلُكَ انْ تَجْعَلَ وَفاتى قَتْلًا فى سَبيلِكَ تَحْتَ رايَةِ نَبِيِّكَ مَعَ اوْلِيآئِكَ، وَاسْئَلُكَ انْ تَقْتُلَ بى اعْدآئَكَ وَاعْدآءَ رَسُولِكَ، وَاسْئَلُكَ انْ تُكْرِمَنى بِهَوانِ مَنْ شِئْتَ مِنْ خَلْقِكَ، وَلا تُهِنّى بِكَرامَةِ احَدٍ مِنْ اوْلِيآئِكَ، اللهُمَّ اجْعَلْ لى مَعَ الرَّسُولِ سَبيلًا، حَسْبِىَ اللَّهُ ما شآءَ اللَّهُ .",
        "english": "...my rank, and grant me that I lower my gaze, and guard my chastity, and refrain through them from all Your prohibitions, so that nothing may be more preferred by me than obedience to You and fear of You, and acting upon what You love, and abandoning what You dislike and have forbidden. And grant that in ease, prosperity, and well-being. And inspire me to be thankful for the favors You have bestowed upon me. I ask You to make my death as being slain in Your cause, under the banner of Your Prophet, along with Your close friends. I ask You to slay through me Your enemies and the enemies of Your Messenger. I ask You to honor me by the humiliation of whomsoever You will of Your creation, and do not humiliate me by the honoring of any of Your close friends. O Allah, make for me a path with the Messenger. Allah is sufficient for me; whatever Allah wills.",
        "transliteration": "darajati wa tarzuqani an aghudda basari wa-an ahfaza farji wa-an akuffa biha 'an jami'i maharimika, hatta la yakuna shay'un athara 'indi min ta'atika wa khashyatika, wal-'amali bima ahbabta, wal-tarki lima karihta wa nahayta 'anhu, wa-j'al dhalika fi yusrin wa yasarin wa 'afiyatin, wa awzi'ni shukra ma an'amta bihi 'alayya, wa as-aluka an taj'ala wafati qatlan fi sabilika tahta rayati nabiyyika ma'a awliya'ika, wa as-aluka an taqtula bi a'da'aka wa a'da'a rasulika, wa as-aluka an tukrimani bi-hawani man shi'ta min khalqika, wa la tuhinni bi-karamati ahadin min awliya'ika, Allahumma-j'al li ma'a al-Rasuli sabilan, hasbiya Allahu ma sha'a Allahu.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_473_1",
            "ref_num": "(1)",
            "title": "الكافي: ج 4، ص 74، ح 6."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 82,
        "content_type": "",
        "translation_mode": "",
        "arabic": "وروى السيّد ابن طاووس في الإقبال عن أبي بصير أنّ الإمام الصادق عليه السلام قال: «",
        "english": "Sayyid Ibn Tawus narrated in al-Iqbal from Abu Basir that Imam al-Sadiq (peace be upon him) said: “",
        "transliteration": "Wa-rawa al-Sayyid Ibn Tawus fi al-Iqbal 'an Abi Basir anna al-Imam al-Sadiq 'alayhi al-salam qala: «",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 83,
        "content_type": "",
        "translation_mode": "",
        "arabic": "ادْعُ للحَجِّ فِي لَيالِي شَهْرِ رَمَضانَ بَعْدَ المَغْرِبِ» .",
        "english": "Supplicate for the Hajj during the nights of the month of Ramadan after the Maghrib prayer.”",
        "transliteration": "Id'u lil-hajji fi layali shahri Ramadana ba'da al-Maghribi. »",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_473_2",
            "ref_num": "(2)",
            "title": "إقبال الأعمال: ص 24."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 84,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "وقال الكفعمي في البلد الأمين: يستحبّ الدعاء به في كلّ يوم من رمضان وفي أوّل ليلة منه .",
        "english": "Al-Kaf’ami said in al-Balad al-Amin: It is recommended to recite this supplication every day of Ramadan and on its first night.",
        "transliteration": "Wa-qala al-Kaf'ami fi al-Balad al-Amin: yustahabbu al-du'a'u bihi fi kulli yawmin min Ramadana wa-fi awwali laylatin minhu.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_473_3",
            "ref_num": "(3)",
            "title": "البلد الأمين: ص 222."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 85,
        "content_type": "",
        "translation_mode": "",
        "arabic": "4. أفضل الأعمال في ليالي شهر رمضان وأيّامه هو تلاوة القرآن الكريم ففيه كان نزول القرآن. وجاء في الحديث: «",
        "english": "4. The best of deeds during the nights and days of the month of Ramadan is the recitation of the Holy Quran, for in it was the revelation of the Quran. It has been narrated in the Hadith: “",
        "transliteration": "4. Afdal al-a'mal fi layali shahri Ramadan wa-ayyamihi huwa tilawat al-Qur'an al-Karim fa-fihi kana nuzulu al-Qur'an. Wa-ja'a fi al-hadith: «",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 86,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "إنَّ لِكُلِّ شَيْ ءٍ رَبِيعاً وَرَبِيعُ القُرآنِ هو شَهْرُ رَمَضَانَ",
        "english": "Indeed, everything has a spring, and the spring of the Quran is the month of Ramadan.”",
        "transliteration": "Inna li-kulli shay'in rabi'an wa-rabi'u al-Qur'ani huwa shahru Ramadana.",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 87,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "» ويستحبّ ختم القرآن ختمة واحدة في كلّ شهر وأقل ما روي في ذلك هو ختمه في كلّ ستة أيّام وأمّا في شهر رمضان فختمه كلّ ثلاثة أيّام ويحسن إن تيسّر له أن يختمه ختمة في كلّ يوم .",
        "english": "It is recommended to complete the recitation of the Quran once every month, and the minimum that has been narrated regarding this is completing it every six days. As for the month of Ramadan, it is to be completed every three days, and it is virtuous, if one is able, to complete it once every day.",
        "transliteration": "» Wa-yustahabbu khatmu al-Qur'ani khatmatan wahidatan fi kulli shahrin wa-aqallu ma ruwiya fi dhalika huwa khatmuhu fi kulli sittati ayyamin wa-amma fi shahri Ramadana fa-khatmuhu kulla thalathati ayyamin wa-yahsunu in tayassara lahu an yakhtimahu khatmatan fi kulli yawmin.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_473_4",
            "ref_num": "(4)",
            "title": "زاد المعاد: ص 109."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 88,
        "content_type": "",
        "translation_mode": "",
        "arabic": "لاشكّ في أنّ من ليس له معرفة بمفاهيم القرآن ومضمونه ينبغي له تدبّر محتوى الآيات والتتلمذ على القرآن مهما قرأ منه قليلًا، كما أنّ من الضروريّ تشكيل جلسات التفسير لفهم هدى القرآن بهذا الخصوص.",
        "english": "There is no doubt that whoever lacks knowledge of the concepts and substance of the Quran should contemplate the content of the verses and become a student of the Quran, however little he may read of it. Likewise, it is essential to establish sessions of exegesis to understand the guidance of the Quran in this regard.",
        "transliteration": "La shakka fi anna man laysa lahu ma'rifatun bi-mafahimi al-Qur'ani wa-madmunihi yanbaghi lahu tadabburu muhtawa al-ayati wal-tatallumudhu 'ala al-Qur'ani mahma qara'a minhu qalilan, kama anna mina al-daruriyyi tashkilu jalasati al-tafsiri li-fahmi huda al-Qur'ani bi-hadha al-khususi.",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 89,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "قال العلّامة المجلسيّ: لو أهدى ثواب الختم للنّبيّ صلى الله عليه و آله وفاطمة الزهراء عليها السلام أو أحد الأئمّة عليهم السلام (أو لإمام العصر عليه السلام) فإنّ ثوابها أكثر . ويظهر من الرواية أنّ ثواب مثل هذا الشخص في يوم القيامة أن يكون في ظلّهم عليهم السلام .",
        "english": "Allamah al-Majlisi said: If one dedicates the reward of the completion [of the Quran] to the Prophet (peace and blessings of Allah be upon him and his family) and Fatima al-Zahra (peace be upon her) or one of the Imams (peace be upon them) (or to the Imam of the Time [peace be upon him]), then its reward is greater. It appears from the narration that the reward for such a person on the Day of Resurrection is to be in their shade (peace be upon them).",
        "transliteration": "Qala al-'Allamah al-Majlisi: law ahda thawaba al-khatmi lin-Nabiyyi salla Allahu 'alayhi wa-alihi wa-Fatimata al-Zahra'i 'alayha al-salam aw ahadi al-A'immati 'alayhim al-salam (aw li-Imami al-'Asri 'alayhi al-salam) fa-inna thawabaha akthar. Wa-yazharu mina al-riwayati anna thawaba mithli hadha al-shakhsi fi yawmi al-qiyamati an yakuna fi zillihim 'alayhim al-salam.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_473_5",
            "ref_num": "(5)",
            "title": "المصدر السابق."
          },
          {
            "ref_id": "content_note_473_6",
            "ref_num": "(6)",
            "title": "إقبال الأعمال: ص 110."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 90,
        "content_type": "",
        "translation_mode": "",
        "arabic": "دَرَجَتى وَتَرْزُقُنى انْ اغُضَّ بَصَرى وَانْ احْفَظَ فَرْجى وَانْ اكُفَّ بِها عَنْ جَميعِ مَحارِمِكَ، حَتّى لايَكُونَ شَىْ ءٌ آثَرَ عِنْدى مِنْ طاعَتِكَ وَخَشْيَتِكَ، وَالْعَمَلِ بِما احْبَبْتَ، وَالتَّرْكِ لِما كَرِهْتَ وَنَهَيْتَ عَنْهُ، وَاجْعَلْ ذلِكَ فى يُسْرٍ وَيَسارٍ وَعافِيَةٍ، وَاوْزِعْنى شُكْرَ ما انْعَمْتَ بِهِ عَلَىَّ، وَاسْئَلُكَ انْ تَجْعَلَ وَفاتى قَتْلًا فى سَبيلِكَ تَحْتَ رايَةِ نَبِيِّكَ مَعَ اوْلِيآئِكَ، وَاسْئَلُكَ انْ تَقْتُلَ بى اعْدآئَكَ وَاعْدآءَ رَسُولِكَ، وَاسْئَلُكَ انْ تُكْرِمَنى بِهَوانِ مَنْ شِئْتَ مِنْ خَلْقِكَ، وَلا تُهِنّى بِكَرامَةِ احَدٍ مِنْ اوْلِيآئِكَ، اللهُمَّ اجْعَلْ لى مَعَ الرَّسُولِ سَبيلًا، حَسْبِىَ اللَّهُ ما شآءَ اللَّهُ .",
        "english": "...my rank, and grant me that I lower my gaze, and guard my chastity, and refrain through them from all Your prohibitions, so that nothing may be more preferred by me than obedience to You and fear of You, acting upon what You love, and abandoning what You dislike and have forbidden. And place all of that in ease, prosperity, and well-being. And inspire me to be thankful for the favors You have bestowed upon me. I ask You to make my death being slain in Your path, under the banner of Your Prophet, along with Your close friends. I ask You to slay through me Your enemies and the enemies of Your Messenger. I ask You to honor me through the humiliation of whomever You will of Your creation, and do not humiliate me through the honoring of any of Your close friends. O Allah, appoint for me a path with the Messenger. Allah is sufficient for me; whatever Allah wills.",
        "transliteration": "darajati wa tarzuqani an aghudda basari wa-an ahfaza farji wa-an akuffa biha 'an jami'i maharimika, hatta la yakuna shay'un athara 'indi min ta'atika wa khashyatika, wal-'amali bima ahbabta, wal-tarki lima karihta wa nahayta 'anhu, waj-'al dhalika fi yusrin wa yasarin wa 'afiyatin, wa-awzi'ni shukra ma an'amta bihi 'alayya, wa as-aluka an taj'ala wafati qatlan fi sabilika tahta rayati nabiyyika ma'a awliya'ika, wa as-aluka an taqtula bi a'da'aka wa a'da'a rasulika, wa as-aluka an tukrimani bi-hawani man shi'ta min khalqika, wa la tuhinni bi-karamati ahadin min awliya'ika, Allahumma-j'al li ma'a al-rasuli sabila, hasbiya Allahu ma sha'a Allahu.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_473_1",
            "ref_num": "(1)",
            "title": "الكافي: ج 4، ص 74، ح 6."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 91,
        "content_type": "",
        "translation_mode": "",
        "arabic": "وروى السيّد ابن طاووس في الإقبال عن أبي بصير أنّ الإمام الصادق عليه السلام قال: «",
        "english": "Sayyid Ibn Tawus narrated in al-Iqbal from Abu Basir that Imam al-Sadiq (peace be upon him) said: “",
        "transliteration": "Wa-rawa al-Sayyid Ibn Tawus fi al-Iqbal 'an Abi Basir anna al-Imam al-Sadiq 'alayhi al-salam qala: «",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 92,
        "content_type": "",
        "translation_mode": "",
        "arabic": "ادْعُ للحَجِّ فِي لَيالِي شَهْرِ رَمَضانَ بَعْدَ المَغْرِبِ» .",
        "english": "Supplicate for the Hajj during the nights of the month of Ramadan after the Maghrib prayer.”",
        "transliteration": "Id'u lil-hajji fi layali shahri Ramadana ba'da al-Maghribi. »",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_473_2",
            "ref_num": "(2)",
            "title": "إقبال الأعمال: ص 24."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 93,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "وقال الكفعمي في البلد الأمين: يستحبّ الدعاء به في كلّ يوم من رمضان وفي أوّل ليلة منه .",
        "english": "Al-Kaf’ami said in al-Balad al-Amin: It is recommended to recite this supplication every day of Ramadan and on its first night.",
        "transliteration": "Wa-qala al-Kaf'ami fi al-Balad al-Amin: yustahabbu al-du'a'u bihi fi kulli yawmin min Ramadana wa-fi awwali laylatin minhu.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_473_3",
            "ref_num": "(3)",
            "title": "البلد الأمين: ص 222."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 94,
        "content_type": "",
        "translation_mode": "",
        "arabic": "4. أفضل الأعمال في ليالي شهر رمضان وأيّامه هو تلاوة القرآن الكريم ففيه كان نزول القرآن. وجاء في الحديث: «",
        "english": "4. The best of deeds during the nights and days of the month of Ramadan is the recitation of the Holy Quran, for in it was the revelation of the Quran. It has been narrated in the Hadith: “",
        "transliteration": "4. Afdal al-a'mal fi layali shahri Ramadan wa-ayyamihi huwa tilawat al-Qur'an al-Karim fa-fihi kana nuzulu al-Qur'an. Wa-ja'a fi al-hadith: «",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 95,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "إنَّ لِكُلِّ شَيْ ءٍ رَبِيعاً وَرَبِيعُ القُرآنِ هو شَهْرُ رَمَضَانَ",
        "english": "Indeed, everything has a spring, and the spring of the Quran is the month of Ramadan.”",
        "transliteration": "Inna li-kulli shay'in rabi'an wa-rabi'u al-Qur'ani huwa shahru Ramadana.",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 96,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "» ويستحبّ ختم القرآن ختمة واحدة في كلّ شهر وأقل ما روي في ذلك هو ختمه في كلّ ستة أيّام وأمّا في شهر رمضان فختمه كلّ ثلاثة أيّام ويحسن إن تيسّر له أن يختمه ختمة في كلّ يوم .",
        "english": "It is recommended to complete the recitation of the Quran once every month, and the minimum that has been narrated regarding this is completing it every six days. As for the month of Ramadan, its completion is every three days, and it is virtuous, if it is made easy for one, to complete it once every day.",
        "transliteration": "» Wa-yustahabbu khatmu al-Qur'ani khatmatan wahidatan fi kulli shahrin wa-aqallu ma ruwiya fi dhalika huwa khatmuhu fi kulli sittati ayyamin wa-amma fi shahri Ramadana fa-khatmuhu kulla thalathati ayyamin wa-yahsunu in tayassara lahu an yakhtumahu khatmatan fi kulli yawmin.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_473_4",
            "ref_num": "(4)",
            "title": "زاد المعاد: ص 109."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 97,
        "content_type": "",
        "translation_mode": "",
        "arabic": "لاشكّ في أنّ من ليس له معرفة بمفاهيم القرآن ومضمونه ينبغي له تدبّر محتوى الآيات والتتلمذ على القرآن مهما قرأ منه قليلًا، كما أنّ من الضروريّ تشكيل جلسات التفسير لفهم هدى القرآن بهذا الخصوص.",
        "english": "There is no doubt that whoever lacks knowledge of the concepts and substance of the Quran should contemplate the content of the verses and become a student of the Quran, however little he may read of it. Likewise, it is essential to establish sessions of exegesis to understand the guidance of the Quran in this regard.",
        "transliteration": "La shakka fi anna man laysa lahu ma'rifatun bi-mafahimi al-Qur'ani wa-madmunihi yanbaghi lahu tadabburu muhtawa al-ayati wal-tatallumudhu 'ala al-Qur'ani mahma qara'a minhu qalilan, kama anna mina al-daruriyyi tashkila jalasati al-tafsiri li-fahmi huda al-Qur'ani bi-hadha al-khususi.",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 98,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "قال العلّامة المجلسيّ: لو أهدى ثواب الختم للنّبيّ صلى الله عليه و آله وفاطمة الزهراء عليها السلام أو أحد الأئمّة عليهم السلام (أو لإمام العصر عليه السلام) فإنّ ثوابها أكثر . ويظهر من الرواية أنّ ثواب مثل هذا الشخص في يوم القيامة أن يكون في ظلّهم عليهم السلام .",
        "english": "Allamah al-Majlisi said: If one dedicates the reward of the completion [of the Quran] to the Prophet (peace and blessings of Allah be upon him and his family) and Fatima al-Zahra (peace be upon her) or one of the Imams (peace be upon them) (or to the Imam of the Time [peace be upon him]), then its reward is greater. It appears from the narration that the reward for such a person on the Day of Resurrection is to be under their shade (peace be upon them).",
        "transliteration": "Qala al-'Allamah al-Majlisi: law ahda thawaba al-khatmi lin-Nabiyyi salla Allahu 'alayhi wa-alihi wa-Fatimata al-Zahra'i 'alayha al-salam aw ahadi al-A'immati 'alayhim al-salam (aw li-Imami al-'Asri 'alayhi al-salam) fa-inna thawabaha akthar. Wa-yazharu mina al-riwayati anna thawaba mithli hadha al-shakhsi fi yawmi al-qiyamati an yakuna fi zillihim 'alayhim al-salam.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_473_5",
            "ref_num": "(5)",
            "title": "المصدر السابق."
          },
          {
            "ref_id": "content_note_473_6",
            "ref_num": "(6)",
            "title": "إقبال الأعمال: ص 110."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 99,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "5. الإكثار من الدعاء والصلوات والاستغفار ويكثر من قوله:",
        "english": "5. Increasing supplication, prayers, and seeking forgiveness, and frequently saying:",
        "transliteration": "5. Al-iktharu mina al-du'a'i wal-salawati wal-istighfari wa-yukthiru min qawlihi:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 100,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "لا إلهَ الَّا اللَّه",
        "english": "There is no god but Allah.",
        "transliteration": "La ilaha illa Allah.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_474_1",
            "ref_num": "(1)",
            "title": "زاد المعاد: ص 109."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 101,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": ". جاء في الخبر:",
        "english": "It has been narrated in the report:",
        "transliteration": "Ja'a fi al-khabar:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 102,
        "content_type": "",
        "translation_mode": "",
        "arabic": "حين كان يدخل شهر رمضان لم يتكلّم الإمام السجاد عليه السلام سوى بالدعاء والتسبيح والاستغفار والتكبير . كما ينبغي الإتيان بنوافل هذا الشهر الكريم خاصّة من لم يوفّق للإتيان بالنوافل (سيّما نافلة الليل) في غير هذا الشهر.",
        "english": "When the month of Ramadan would begin, Imam al-Sajjad (peace be upon him) would not speak except with supplication, glorification, seeking forgiveness, and magnification. Likewise, it is fitting to perform the supererogatory prayers of this noble month, especially for those who were not granted the success to perform the supererogatory prayers (particularly the Night Prayer) outside of this month.",
        "transliteration": "Hayna kana yadkhulu shahru Ramadana lam yatakkalam al-Imam al-Sajjad 'alayhi al-salam siwa bil-du'a'i wal-tasbihi wal-istighfari wal-takbiri. Kama yanbaghi al-ityanu bi-nawafili hadha al-shahri al-karimi khassatan man lam yuwaffaq lil-ityani bil-nawafili (siyyama nafilata al-layli) fi ghayri hadha al-shahri.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_474_2",
            "ref_num": "(2)",
            "title": "الكافي: ج 4، ص 88، ح 8."
          },
          {
            "ref_id": "content_note_474_3",
            "ref_num": "(3)",
            "title": "زاد المعاد: ص 109."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 103,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "5. الإكثار من الدعاء والصلوات والاستغفار ويكثر من قوله:",
        "english": "5. Increasing supplication, prayers, and seeking forgiveness, and frequently saying:",
        "transliteration": "5. Al-iktharu mina al-du'a'i wal-salawati wal-istighfari wa-yukthiru min qawlihi:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 104,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "لا إلهَ الَّا اللَّه",
        "english": "There is no god but Allah.",
        "transliteration": "La ilaha illa Allah.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_474_1",
            "ref_num": "(1)",
            "title": "زاد المعاد: ص 109."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 105,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": ". جاء في الخبر:",
        "english": "It has been narrated in the report:",
        "transliteration": "Ja'a fi al-khabar:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 106,
        "content_type": "",
        "translation_mode": "",
        "arabic": "حين كان يدخل شهر رمضان لم يتكلّم الإمام السجاد عليه السلام سوى بالدعاء والتسبيح والاستغفار والتكبير . كما ينبغي الإتيان بنوافل هذا الشهر الكريم خاصّة من لم يوفّق للإتيان بالنوافل (سيّما نافلة الليل) في غير هذا الشهر.",
        "english": "When the month of Ramadan would begin, Imam al-Sajjad (peace be upon him) would not speak except with supplication, glorification, seeking forgiveness, and magnification. Likewise, it is fitting to perform the supererogatory prayers of this noble month, especially for those who were not granted the success to perform the supererogatory prayers (especially the night prayer) in months other than this month.",
        "transliteration": "Hayna kana yadkhulu shahru Ramadana lam yatakkalam al-Imam al-Sajjad 'alayhi al-salam siwa bil-du'a'i wal-tasbihi wal-istighfari wal-takbiri. Kama yanbaghi al-ityanu bi-nawafili hadha al-shahri al-karimi khassatan man lam yuwaffaq lil-ityani bil-nawafili (siyyama nafilata al-layli) fi ghayri hadha al-shahri.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_474_2",
            "ref_num": "(2)",
            "title": "الكافي: ج 4، ص 88، ح 8."
          },
          {
            "ref_id": "content_note_474_3",
            "ref_num": "(3)",
            "title": "زاد المعاد: ص 109."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 107,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "الأعمال التي يؤتى بها في ليالي شهر رمضان هي:",
        "english": "The deeds to be performed during the nights of the month of Ramadan are:",
        "transliteration": "Al-a'malu allati yu'ta biha fi layali shahri Ramadana hiya:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 108,
        "content_type": "",
        "translation_mode": "",
        "arabic": "1. الإفطار عند دخول وقت الغروب الشرعيّ، ويستحبّ تأخيره عن صلاة العشاء إلّاإذا غلب عليه الضعف أو كان له قوم ينتظرونه .",
        "english": "1. Breaking the fast at the onset of the legal time of sunset; it is recommended to delay it until after the Isha prayer, unless one is overcome by weakness or there are people waiting for him.",
        "transliteration": "1. Al-iftaru 'inda dukhuli waqti al-ghurubi al-shar'iyyi, wa-yustahabbu takhiruhu 'an salati al-'isha'i illa idha ghalaba 'alayhi al-du'fu aw kana lahu qawmun yantazirunahu.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_474_4",
            "ref_num": "(4)",
            "title": "المصدر السابق: ص 108."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 109,
        "content_type": "",
        "translation_mode": "",
        "arabic": "2. أن يفطر بالحلال الخالي من الشبهات . ويحسن الإفطار بالتمر حيث ورد في الحديث أن من أفطر على التمر ضوعف أجره .",
        "english": "2. Breaking the fast with what is lawful and free from ambiguities. It is virtuous to break the fast with dates, as it has been narrated in the Hadith that whoever breaks his fast with dates, his reward is multiplied.",
        "transliteration": "2. An yuftira bil-halali al-khali mina al-shubuhat. Wa-yahsunu al-iftaru bit-tamri haythu warada fi al-hadithi anna man aftara 'ala al-tamri du'ifa ajruhu.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_474_5",
            "ref_num": "(5)",
            "title": "إقبال الأعمال: ص 114."
          },
          {
            "ref_id": "content_note_474_6",
            "ref_num": "(6)",
            "title": "المصدر السابق."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 110,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "وعن عليّ عليه السلام أنّه: «",
        "english": "And it is narrated from Ali (peace be upon him) that he: “",
        "transliteration": "Wa-'an 'Aliyyin 'alayhi al-salam annahu: «",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 111,
        "content_type": "",
        "translation_mode": "",
        "arabic": "يُسْتَحَبّ الإفطارُ باللَّبَنِ»",
        "english": "It is recommended to break the fast with milk.”",
        "transliteration": "Yustahabbu al-iftaru bil-labani. »",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_474_7",
            "ref_num": "(7)",
            "title": "المصدر السابق."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 112,
        "content_type": "",
        "translation_mode": "",
        "arabic": ". ويمكن الإفطار بالماء الحار والسكّر والحلوى حيث كان يفطر بها رسول اللَّه صلى الله عليه و آله .",
        "english": "And one may break the fast with warm water, sugar, and sweets, as the Messenger of Allah (peace and blessings of Allah be upon him and his family) used to break his fast with them.",
        "transliteration": "Wa-yumkinu al-iftaru bil-ma'i al-harri wal-sukkari wal-halwa haythu kana yuftiru biha Rasulu Allahi salla Allahu 'alayhi wa-alihi.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_474_8",
            "ref_num": "(8)",
            "title": "زاد المعاد: ص 108."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 113,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "3. أن يدعو عند الإفطار بالدعوات المأثورة ومنها:",
        "english": "3. To supplicate at the time of breaking the fast with the narrated supplications, including:",
        "transliteration": "3. An yad'uwa 'inda al-iftari bil-da'awati al-ma'thurati wa-minha:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 114,
        "content_type": "",
        "translation_mode": "",
        "arabic": "أ) اللهُمَّ لَكَ صُمْتُ، وَعَلى رِزْقِكَ افْطَرْتُ، وَعَلَيْكَ تَوَكَّلْتُ .",
        "english": "a) O Allah, for You I have fasted, and with Your sustenance I have broken my fast, and in You I have placed my trust.",
        "transliteration": "a) Allahumma laka sumtu, wa-'ala rizqika aftartu, wa-'alayka tawakkaltu.",
        "phrases": [],
        "footnote_refs": [
          {
            "ref_id": "content_note_474_9",
            "ref_num": "(9)",
            "title": "إقبال الأعمال: ص 117."
          }
        ],
        "custom_title": ""
      },
      {
        "id": 115,
        "content_type": "commentary",
        "translation_mode": "block",
        "arabic": "ب) وكان أميرالمؤمنين عليه السلام إذا أراد أن يفطر يقول:",
        "english": "b) When the Commander of the Faithful (peace be upon him) intended to break his fast, he would say:",
        "transliteration": "b) Wa-kana Amiru al-Mu'minina 'alayhi al-salam idha arada an yuftira yaqulu:",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      },
      {
        "id": 116,
        "content_type": "",
        "translation_mode": "",
        "arabic": "بِسْمِ اللَّهِ، اللَّهُمَّ لَكَ صُمْنا، وَعَلى رِزْقِكَ افْطَرْنا، فَتَقَبَّلْ مِنَّا، انَّكَ انْتَ السَّميعُ",
        "english": "In the name of Allah. O Allah, for You we have fasted, and with Your sustenance we have broken our fast, so accept [it] from us; indeed, You are the All-Hearing.",
        "transliteration": "Bismi Allahi, Allahumma laka sumna, wa-'ala rizqika aftarna, fa-taqabbal minna, innaka anta al-Sami'u.",
        "phrases": [],
        "footnote_refs": [],
        "custom_title": ""
      }
    ]
  }
}