{
  "title": "Charity & Providing Iftar",
  "id": "charity_&_providing_iftar",
  "content_type": "amaal",
  "level": "L2",
  "description": "Encouragement to give charity and provide Iftar to fasting believers, citing the immense rewards promised by the Prophet (s) and Imam al-Sadiq (a.s.), even for those with limited means.",
  "preamble": {
    "arabic": "أن يتصدّق عند الافطار ويفطر الصائمين ولو بعدد من التمر أو بشربة ماء. فالإفطار من المستحبّات المؤكّدة التي لا ينبغي أن يغفلها المؤمنون، حيث تنصب مائدة كبيرة في جميع مساجد بعض الدول الإسلاميّة عند الإفطار",
    "english": "To give charity at the time of breaking the fast and to provide sustenance for those who are fasting, even if it be with a few dates or a drink of water. Providing the meal for breaking the fast is among the emphatically recommended acts that the believers should not neglect; indeed, grand spreads are prepared in all the mosques of some Islamic countries at the time of breaking the fast."
  },
  "phrases": [
    {
      "arabic": "فقد روي عن رسول اللَّه صلى الله عليه و آله:",
      "english": "It has been narrated on the authority of the Messenger of Allah, peace be upon him and his progeny:",
      "transliteration": "Faqad ruwiya ‘an Rasūl Allāh ṣallā Allāhu ‘alayhi wa-ālih:"
    },
    {
      "arabic": "«",
      "english": "Please provide the Arabic text you would like translated. The space between the brackets in your prompt was empty. Once you provide the text, I will translate it into formal, reverent English according to your instructions.",
      "transliteration": "Please provide the Arabic text you would like me to transliterate."
    },
    {
      "arabic": "أنّ مَن فَطَّرَ صائِماً كانَ لَهُ كَعِتْقِ رَقَبةٍ مُؤمِنَةٍ",
      "english": "Verily, whosoever provides for a fasting person to break their fast, for him is a reward equivalent to the emancipation of a believing soul.",
      "transliteration": "Anna man faṭṭara ṣā’iman kāna lahū ka-ʿitqi raqabatin mu’minah."
    },
    {
      "arabic": "»،",
      "english": "O Allah, bless Muhammad and the family of Muhammad, and place light in my vision, insight in my religion, certainty in my heart, sincerity in my deeds, safety in my soul, abundance in my sustenance, and gratitude to You forever, for as long as You grant me life.",
      "transliteration": "\","
    },
    {
      "arabic": "فلمّا قال له أصحابه ليس كلّنا نقدر على ذلك.",
      "english": "When his companions said to him, \"Not all of us are able to do that.\"",
      "transliteration": "Falammā qāla lahu aṣḥābuhu laysa kullunā naqdiru ʿalā dhālika."
    },
    {
      "arabic": "قال:",
      "english": "He said:",
      "transliteration": "Qāla:"
    },
    {
      "arabic": "«",
      "english": "O Allah, be for Your representative, the Proof, son of al-Hasan—Your blessings be upon him and his forefathers—at this hour and at every hour, a Guardian, a Protector, a Leader, a Helper, a Guide, and a Watchful Eye, until You settle him upon Your earth in willing obedience and grant him to dwell therein for a long time.",
      "transliteration": "Allāhumma ṣalli ‘alā Muḥammad wa ‘alā āli Muḥammad"
    },
    {
      "arabic": "وَلَوْ بِشَقِّ تَمْرَةٍ أو بِشَرْبَةِ مَاءٍ»(5).",
      "english": "Even if it be with half a date or a draught of water.",
      "transliteration": "Wa-law bi-shaqqi tamratin aw bi-sharbati mā’in (5)."
    },
    {
      "arabic": "وفي رواية عن الإمام الصادق عليه السلام:",
      "english": "And in a narration from Imam al-Sadiq, peace be upon him:",
      "transliteration": "Wa fī riwāyatin ʿan al-Imām al-Ṣādiq ʿalayhi al-salām:"
    },
    {
      "arabic": "«",
      "english": "O Allah, bless Muhammad and the progeny of Muhammad. Hear my prayer when I call upon You, hear my cry when I call out to You, and turn towards me when I commune with You. For I have indeed fled to You and stood before You, humbled before You, beseeching You, and hoping for the reward that is with You. You know what is within my soul, You are aware of my need, and You know my innermost thoughts. Neither my ultimate return nor my final abode is hidden from You, nor that which I wish to manifest of my speech, or utter of my petition, or hope for regarding my end.",
      "transliteration": "(No Arabic text provided)"
    },
    {
      "arabic": "أنّ مَنْ فَطَّرَ صائِماً فَلَهُ أجْرٌ مِثْلُه (دونَ أن يَنْقُصَ مِن أجْرِه شَي ءٌ)»(6).",
      "english": "Indeed, whoever provides for a fasting person to break their fast shall receive a reward equal to theirs, without any diminution in the reward of the fasting person.",
      "transliteration": "Anna man faṭṭara ṣā’iman falahū ajrun mithluhu (dūna an yanquṣa min ajrihi shay’un) (6)."
    },
    {
      "arabic": "8.",
      "english": "O Allah, make me, in this my station, among those who attain from You blessings, mercy, and forgiveness.",
      "transliteration": "Thamāniyah"
    },
    {
      "arabic": "أن يدعو بعد المغرب بدعاء الحجّ الذي مضى سابقاً (ص 471).",
      "english": "One should recite, after the Maghrib prayer, the Supplication of Hajj which was previously mentioned (p. 471).",
      "transliteration": "An yad‘ū ba‘da al-maghrib bi-du‘ā’ al-ḥajj al-ladhī maḍā sābiqan (ṣ. 471)."
    },
    {
      "arabic": "9.",
      "english": "O Allah, place me within Your fortified armor, in which You place whomsoever You will.",
      "transliteration": "Tis‘ah"
    },
    {
      "arabic": "روى السيّد ابن طاووس في الإقبال:",
      "english": "Sayyid ibn Tawus has narrated in *al-Iqbal*:",
      "transliteration": "Rawā al-Sayyid ibn Ṭāwūs fī al-Iqbāl:"
    },
    {
      "arabic": "إنّ مَن دعا بهذا الدعاء في كلّ ليلة من شهر رمضان غفرت له ذنوبه:",
      "english": "Verily, whosoever offers this supplication every night during the month of Ramadan, his sins shall be forgiven.",
      "transliteration": "Inna man da‘ā bihādhā ad-du‘ā’ fī kulli laylatin min shahri ramaḍāna ghufirat lahu dhunūbuh."
    },
    {
      "arabic": "اللهُمَّ رَبَّ شَهْرِ رَمَضانَ،",
      "english": "O Allah, Lord of the month of Ramadan,",
      "transliteration": "Allahumma rabba shahri ramaḍāna,"
    },
    {
      "arabic": "الَّذى انْزَلْتَ فيهِ الْقُرْآنَ،",
      "english": "in which You revealed the Qur’an,",
      "transliteration": "al-ladhī anzalta fīhi al-qur’ān,"
    },
    {
      "arabic": "وَافْتَرَضْتَ على عِبادِكَ فيهِ الصِّيامَ،",
      "english": "And You have made fasting therein obligatory upon Your servants,",
      "transliteration": "Wa-ftaraḍta ‘alā ‘ibādika fīhiṣ-ṣiyāma,"
    },
    {
      "arabic": "صَلِّ عَلى مُحَمَّدٍ وَآلِ مُحَمَّدٍ،",
      "english": "Bless Muhammad and the progeny of Muhammad.",
      "transliteration": "Salli ‘ala Muhammadin wa ali Muhammad."
    },
    {
      "arabic": "وَارْزُقْنى حَجَّ بَيْتِكَ الْحَرامِ،",
      "english": "And grant me the pilgrimage to Your Sacred House,",
      "transliteration": "Warzuqnī ḥajja baytika al-ḥarām,"
    },
    {
      "arabic": "فى عامى هذا وَفى كُلِّ عامٍ،",
      "english": "In this year of mine and in every year,",
      "transliteration": "fī ʿāmī hādhā wa-fī kulli ʿāmin,"
    },
    {
      "arabic": "وَاغْفِرْ لى تِلْكَ الذُّنُوبَ الْعِظامَ،",
      "english": "And forgive me those great sins,",
      "transliteration": "Waghfir lī tilka adh-dhunūba al-ʿiẓāma."
    },
    {
      "arabic": "فَانَّهُ لا يَغْفِرُها غَيْرُكَ يا رَحْمنُ يا عَلّامُ (7).",
      "english": "For truly, none forgives them save You, O All-Merciful, O All-Knowing.",
      "transliteration": "Fa-innahu lā yaghfiruhā ghayruka yā Raḥmānu yā ‘Allāmu (7)."
    }
  ]
}