{
  "title": "Etiquette of Breaking the Fast (Iftar)",
  "id": "etiquette_of_breaking_the_fast_(iftar)",
  "content_type": "amaal",
  "level": "L1",
  "description": "Guidelines on the recommended timing for Iftar (preferably after evening prayers) and the most meritorious foods to break the fast with, such as dates, milk, or warm water.",
  "phrases": [
    {
      "arabic": "الأعمال التي يؤتى بها في ليالي شهر رمضان هي:",
      "english": "The acts of devotion to be observed during the nights of the month of Ramadan are:",
      "transliteration": "Al-a‘māl allatī yu’tā bihā fī layālī shahri ramaḍāna hiya:"
    },
    {
      "arabic": "الإفطار عند دخول وقت الغروب الشرعيّ،",
      "english": "Breaking the fast upon the onset of the religiously prescribed time of sunset.",
      "transliteration": "Al-ifṭār ʿinda dukhūl waqt al-ghurūb al-sharʿī,"
    },
    {
      "arabic": "ويستحبّ تأخيره عن صلاة العشاء إلّاإذا غلب عليه الضعف أو كان له قوم ينتظرونه (4).",
      "english": "It is recommended to delay its performance until after the Isha prayer, unless one is overcome by weakness or is being awaited by a congregation.",
      "transliteration": "Wa-yustahabbu ta’khīruhu ‘an ṣalāt al-‘ishā’ illā idhā ghalaba ‘alayhi al-ḍa‘fu aw kāna lahu qawmun yantazirūnahu (4)."
    },
    {
      "arabic": "أن يفطر بالحلال الخالي من الشبهات (5).",
      "english": "That he break his fast with lawful sustenance, free from all ambiguities (5).",
      "transliteration": "An yuftira bi-l-ḥalāl al-khālī min ash-shubuhāt (5)."
    },
    {
      "arabic": "ويحسن الإفطار بالتمر حيث ورد في الحديث أن من أفطر على التمر ضوعف أجره (6).",
      "english": "It is meritorious to break the fast with dates, as it has been related in the tradition that whoever breaks their fast with dates shall have their reward multiplied (6).",
      "transliteration": "Wa-yaḥsunu al-ifṭāru bit-tamri ḥaythu warada fī al-ḥadīthi anna man afṭara ʿalā al-tamri ḍūʿifa ajruhu (6)."
    },
    {
      "arabic": "وعن عليّ عليه السلام أنّه:",
      "english": "And it is narrated on the authority of Ali (peace be upon him) that he:",
      "transliteration": "Wa ‘an ‘Aliyyin ‘alayhis-salām annahu:"
    },
    {
      "arabic": "يُسْتَحَبّ الإفطارُ باللَّبَنِ»(7)",
      "english": "It is recommended to break the fast with milk.",
      "transliteration": "Yustahabbu al-ifṭāru bi’l-labani»(7)"
    },
    {
      "arabic": "ويمكن الإفطار بالماء الحار والسكّر والحلوى حيث كان يفطر بها رسول اللَّه صلى الله عليه و آله",
      "english": "It is permissible to break the fast with warm water, sugar, and sweets, as the Messenger of Allah—peace be upon him and his family—would break his fast with them.",
      "transliteration": "Wa yumkinu al-ifṭāru bil-mā’i al-ḥārri was-sukkari wal-ḥalwā ḥaythu kāna yufṭiru bihā Rasūlu-llāhi ṣallā-llāhu ‘alayhi wa-ālih."
    }
  ]
}