{
  "title": "The Spring of the Quran (Rabee’ al-Quran)",
  "id": "the_spring_of_the_quran_(rabee’_al-quran)",
  "content_type": "amaal",
  "level": "L1",
  "description": "A guide on the immense merit of reciting the Holy Quran during Ramadan, recommended schedules for completion, and the rewards of gifting the recitation to the Ahlul Bayt (a.s.).",
  "phrases": [
    {
      "arabic": "أفضل الأعمال في ليالي شهر رمضان وأيّامه هو تلاوة القرآن الكريم ففيه كان نزول القرآن.",
      "english": "The most virtuous of deeds during the nights and days of the month of Ramadan is the recitation of the Holy Qur'an, for it was during this month that the Qur'an was revealed.",
      "transliteration": "Afḍalu al-a‘māli fī layālī shahri Ramaḍāna wa ayyāmihi huwa tilāwatu al-Qur’āni al-Karīm, fafīhi kāna nuzūlu al-Qur’ān."
    },
    {
      "arabic": "وجاء في الحديث:",
      "english": "And it has been narrated in the tradition:",
      "transliteration": "Wa jā’a fī al-ḥadīth:"
    },
    {
      "arabic": "إنَّ لِكُلِّ شَيْ ءٍ رَبِيعاً وَرَبِيعُ القُرآنِ هو شَهْرُ رَمَضَانَ",
      "english": "Verily, for everything there is a springtime, and the springtime of the Qur’an is the month of Ramadan.",
      "transliteration": "Inna li-kulli shay’in rabī‘an wa rabī‘u al-Qur’āni huwa shahru Ramaḍāna."
    },
    {
      "arabic": "ويستحبّ ختم القرآن ختمة واحدة في كلّ شهر وأقل ما روي في ذلك هو ختمه في كلّ ستة أيّام وأمّا في شهر رمضان فختمه كلّ ثلاثة أيّام ويحسن إن تيسّر له أن يختمه ختمة في كلّ يوم (4).",
      "english": "It is recommended to complete the recitation of the Quran once every month. The minimum duration reported in this regard is its completion every six days. As for the month of Ramadan, it is to be completed every three days; and it is virtuous, if it be made easy for the believer, to complete one full recitation every day.",
      "transliteration": "Wa-yustahabbu khatmu al-Qur’āni khatmatan wāḥidatan fī kulli shahrin wa-aqallu mā ruwiya fī dhālika huwa khatmuhu fī kulli sittati ayyāmin wa-ammā fī shahri Ramaḍāna fa-khatmuhu kulla thalāthati ayyāmin wa-yaḥsunu in tayassara lahu an yakhtimahu khatmatan fī kulli yawmin (4)."
    },
    {
      "arabic": "لاشكّ في أنّ من ليس له معرفة بمفاهيم القرآن ومضمونه ينبغي له تدبّر محتوى الآيات والتتلمذ على القرآن مهما قرأ منه قليلًا،",
      "english": "Undoubtedly, whosoever lacks knowledge of the concepts and essence of the Quran ought to contemplate the substance of its verses and seek discipleship under the Quran, regardless of how small a portion he may recite thereof.",
      "transliteration": "Lā shakka fī anna man laysa lahu ma‘rifah bi-mafāhīmi al-Qur’ān wa-madmūnihi yanbaghī lahu tadabburu muḥtawā al-āyāt wa-at-tatallumudhu ‘alā al-Qur’ān mahmā qara’a minhu qalīlan."
    },
    {
      "arabic": "كما أنّ من الضروريّ تشكيل جلسات التفسير لفهم هدى القرآن بهذا الخصوص.",
      "english": "Furthermore, it is essential to establish circles of exegesis to comprehend the guidance of the Quran in this regard.",
      "transliteration": "Kamā anna mina al-ḍarūriyyi tashkīla jalasāti al-tafsīri li-fahmi hudā al-Qur’āni bi-hādhā al-khuṣūṣ."
    },
    {
      "arabic": "قال العلّامة المجلسيّ:",
      "english": "The erudite scholar Al-Majlisi stated:",
      "transliteration": "Qāla al-ʿAllāmah al-Majlisī:"
    },
    {
      "arabic": "لو أهدى ثواب الختم للنّبيّ صلى الله عليه و آله وفاطمة الزهراء عليها السلام أو أحد الأئمّة عليهم السلام (أو لإمام العصر عليه السلام) فإنّ ثوابها أكثر(5).",
      "english": "If one dedicates the reward of the completion of the recitation to the Prophet—may the peace and blessings of Allah be upon him and his progeny—and Fatima al-Zahra—peace be upon her—or one of the Imams—peace be upon them—(or to the Imam of the Age—peace be upon him), then indeed its reward is greater.",
      "transliteration": "Law ahdā thawāb al-khatm li-n-Nabiyy (ṣallā Allāhu ‘alayhi wa-ālihi) wa-Fāṭimah al-Zahrā’ (‘alayhā al-salām) aw aḥad al-a’immah (‘alayhim al-salām) (aw li-Imām al-‘Aṣr ‘alayhi al-salām) fa-inna thawābahā akthar (5)."
    },
    {
      "arabic": "ويظهر من الرواية أنّ ثواب مثل هذا الشخص في يوم القيامة أن يكون في ظلّهم عليهم السلام (6).",
      "english": "It is evident from the narration that the reward for such an individual on the Day of Resurrection shall be to abide within their shade, peace be upon them (6).",
      "transliteration": "Wa yaẓharu min al-riwāyati anna thawāba mithli hādhā al-shakhṣi fī yawm al-qiyāmati an yakūna fī ẓillihim ‘alayhim al-salām (6)."
    }
  ]
}